glm-disagg/results/qps/2ptp1_1dtp2/result_qps9.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-disagg
  Decode pod:   ms-glm-disagg-llm-d-modelservice-decode-8599766875-765qr
  Decode log:   results/qps/2ptp1_1dtp2//decode_qps9.log
  Prefill pod:  ms-glm-disagg-llm-d-modelservice-prefill-8d997bcdf-8p7tw
  Prefill log:  results/qps/2ptp1_1dtp2//prefill_qps9.log
  Metrics from: prefill pods  IPs: 10.244.2.87 10.244.4.184  (port: 8000)
  NIXL from:    decode pods  IPs: 10.244.5.245  (port: 8200)

Starting decode pod log capture to results/qps/2ptp1_1dtp2//decode_qps9.log ...
Starting prefill pod log capture to results/qps/2ptp1_1dtp2//prefill_qps9.log ...

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  10.244.2.87: queue(sum=10861.692701, count=620) prefill(sum=1877.106510, count=620)
  10.244.4.184: queue(sum=11335.289613, count=644) prefill(sum=1960.028271, count=644)
  NIXL (decode pods):
  10.244.5.245: xfer(sum=213.513299, count=2528) post(sum=3.194387, count=2528) bytes(sum=1695175147520, count=2528) desc(sum=103465280, count=2528)

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
  Target: glm-disagg | QPS: 9
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-disagg 4096 256 9

#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-disagg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 9 req/s (Poisson)  NUM_PROMPTS: 270

BENCH_RUN: request_rate=9 num_prompts=270
INFO 02-27 17:33:56 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 17:33:56 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 17:33:56 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 17:33:58 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8c1d646d40>, seed=33173353, num_prompts=270, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=9.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-68bde7ab-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 17:34:00 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/270 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 9.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 270/270 [02:14<00:00,  2.01it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     270       
Failed requests:                         0         
Request rate configured (RPS):           9.00      
Benchmark duration (s):                  134.12    
Total input tokens:                      1105650   
Total generated tokens:                  69120     
Request throughput (req/s):              2.01      
Output token throughput (tok/s):         515.34    
Peak output token throughput (tok/s):    620.00    
Peak concurrent requests:                220.00    
Total token throughput (tok/s):          8758.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          47106.44  
Median TTFT (ms):                        47397.14  
P99 TTFT (ms):                           97747.77  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.43     
Median TPOT (ms):                        23.66     
P99 TPOT (ms):                           23.81     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.43     
Median ITL (ms):                         23.52     
P99 ITL (ms):                            32.86     
==================================================
BENCH_RUN_END: request_rate=9

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  10.244.2.87: queue(sum=17422.826564, count=764) prefill(sum=2382.876691, count=764)
  10.244.4.184: queue(sum=16240.829160, count=770) prefill(sum=2401.803029, count=770)
  NIXL (decode pods):
  10.244.5.245: xfer(sum=261.358614, count=3068) post(sum=4.300715, count=3068) bytes(sum=2057563013120, count=3068) desc(sum=125583680, count=3068)

==============================================
Prometheus Metrics Summary (qps=9)
==============================================
Prefill Pod Metrics:
  Pod 10.244.2.87:
    request_queue_time:   avg = 45.563430 s  (count=144)
    request_prefill_time: avg = 3.512293 s  (count=144)
  Pod 10.244.4.184:
    request_queue_time:   avg = 38.932854 s  (count=126)
    request_prefill_time: avg = 3.506149 s  (count=126)
  System total (2 prefill pods):
    request_queue_time:   avg = 42.469161 s  (count=270)
    request_prefill_time: avg = 3.509426 s  (count=270)

NIXL KV Transfer Metrics (decode pods):
  Decode 10.244.5.245:
    total_transfers:    540
    avg_xfer_time:      88.602 ms
    avg_post_time:      2.049 ms
    avg_mb_per_xfer:    671.1 MB
    avg_descriptors:    40960

Stopping log captures...
Decode log:  results/qps/2ptp1_1dtp2//decode_qps9.log (26 lines, 8.0K)
Prefill log: results/qps/2ptp1_1dtp2//prefill_qps9.log (157 lines, 28K)